#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
github_repository.managed["portfolio-code-scanner"]: Refreshing state... [id=portfolio-code-scanner]
github_repository.managed["portfolio-github-example"]: Refreshing state... [id=portfolio-github-example]
github_repository.managed["portfolio-github-management"]: Refreshing state... [id=portfolio-github-management]
github_repository_collaborator.managed["portfolio-code-scanner:ghaworkflow"]: Refreshing state... [id=portfolio-code-scanner:ghaworkflow]
github_repository_collaborator.managed["portfolio-github-example:ghaworkflow"]: Refreshing state... [id=portfolio-github-example:ghaworkflow]
github_repository_collaborator.managed["portfolio-github-management:ghaworkflow"]: Refreshing state... [id=portfolio-github-management:ghaworkflow]
github_branch_protection.main["portfolio-github-management"]: Refreshing state... [id=BPR_kwDOQj9B584EQczj]
github_branch_protection.main["portfolio-code-scanner"]: Refreshing state... [id=BPR_kwDOQj8lqc4EQ-vz]
github_branch_protection.main["portfolio-github-example"]: Refreshing state... [id=BPR_kwDOQ1CA-M4EQ_PX]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.main["portfolio-template-iac"] will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = true
        }
    }

  # github_repository.managed["portfolio-template-iac"] will be created
  + resource "github_repository" "managed" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "IaC template repository"
      + etag                        = (known after apply)
      + fork                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = true
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "portfolio-template-iac"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + source_owner                = (known after apply)
      + source_repo                 = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "cloudformation",
          + "iac",
          + "portfolio",
          + "sdlc",
          + "template",
          + "terraform",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_collaborator.managed["portfolio-template-iac:ghaworkflow"] will be created
  + resource "github_repository_collaborator" "managed" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "portfolio-template-iac"
      + username                    = "ghaworkflow"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories     = {
      + portfolio-template-iac      = {
          + full_name = (known after apply)
          + html_url  = (known after apply)
          + http_url  = (known after apply)
          + id        = (known after apply)
          + node_id   = (known after apply)
          + ssh_url   = (known after apply)
        }
        # (3 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @williambrady, Action: `pull_request`*